desSLM = <html><div style="padding-left:5px;padding-top:5px;margin: 0 0.07em 0 -0.13em;background-color:white;width:100%;word-spacing:30px;font-family:MS Mincho;font-size:11px;font-weight: normal;">&nbsp; &nbsp; &nbsp; LCOS-SLM (Liquid Crystal on Silicon- Spatial Light Modulator)\u662f \u80fd \u8abf \u5236<br /><div style=\"width:100%;height:3px;\"></div>\u5149 \u632f \u5e45 \u53ca \u76f8 \u4f4d \u7684 \u7a7a \u9593 \u5149 \u8abf \u5236 \u5668\uff0c\u5176 \u5167 \u90e8 \u7d50 \u69cb \u5982 \u540c \u4e00 \u822c \u7684 \u6db2 \u6676 \u986f<br /><div style=\"width:100%;height:3px;\"></div>\u793a \u5668\uff0c\u662f \u7531 \u8a31 \u591a \u683c \u72c0 \u7684 \u50cf \u7d20 \u6240 \u7d44 \u6210 \u7684 \u77e9 \u9663 \u7d50 \u69cb\uff0c\u7576 \u65bd \u52a0 \u96fb \u58d3 \u6642 \u6bcf<br /><div style=\"width:100%;height:3px;\"></div>\u4e00 \u500b \u50cf \u7d20 \u4e0a \u7684 \u6db2 \u6676 \u6703 \u4f9d \u96fb \u58d3 \u5927  \u5c0f \u6709 \u4e0d \u540c \u89d2 \u5ea6 \u7684 \u504f \u8f49 \u9020 \u6210 \u4e0d \u540c<br /><div style=\"width:100%;height:3px;\"></div>\u7684 \u6298 \u5c04 \u7387 \u800c \u9054 \u5230 \u8abf \u5236 \u7684 \u6548 \u679c\u3002 \u5728 \u672a \u7d66 \u4e88 \u8a0a \u865f \u7684 \u60c5 \u5f62 \u4e0b SLM \u57fa \u672c<br /><div style=\"width:100%;height:3px;\"></div>\u7684 \u7d50 \u69cb \u5c31 \u6703 \u5f71 \u97ff \u5230 \u5149 \u7684 \u8868 \u73fe\uff0c\u5305 \u62ec \u6700 \u5927 \u7e5e \u5c04 \u89d2 \u5ea6\u3001\u7e5e \u5c04 \u6548 \u7387\u3001\u53ca<br /><div style=\"width:100%;height:3px;\"></div>\u504f \u632f \u614b \u7684 \u8b8a \u5316\uff0c\u5229 \u7528 \u9019 \u4e9b \u7279 \u6027 \u6211 \u5011 \u4fbf \u80fd \u63a8 \u7b97 \u51fa SLM \u5404 \u9805 \u57fa \u672c \u53c3<br /><div style=\"width:100%;height:3px;\"></div> \u6578\uff0c\u5982 \u50cf \u7d20 \u5927 \u5c0f\u3001\u958b  \u53e3 \u7387\u3001\u53ca \u914d \u5411 \u89d2  \u5ea6\u3002<br /><div style=\"width:100%;height:25px;\"></div><br></div></html>
desAmplitude = <html><div style="padding-left:6px;padding-top:5px;margin: 0 0.07em 0 -0.13em;background-color:white;width:100%;word-spacing:30px;font-family:MS Mincho;font-size:11px;font-weight: normal;">&nbsp; &nbsp; &nbsp;SLM \u914d \u5408 \u504f \u632f \u7247(Polarizer)\u8207 \u6aa2 \u504f \u7247(Analyzer)\u7684 \u89d2 \u5ea6 \u8abf \u6574 \u80fd \u4f7f SLM<br /><div style=\"width:100%;height:3px;\"></div>\u8b8a \u6210 \u632f \u5e45 \u8abf \u5236 \u5668(Amplitude Modulator)\u6216 \u662f \u76f8 \u4f4d \u8abf \u5236 \u5668 (Phase Modulator)<br /><div style=\"width:100%;height:3px;\"></div>\u5728 \u6b64 \u5be6 \u9a57 \u4e2d \u6211 \u5011 \u8abf \u6574 \u504f \u632f \u7247 \u53ca \u6aa2 \u504f \u7247 \u7684 \u89d2 \u5ea6 \u4f7f \u5176 \u8207 \u914d \u5411 \u89d2 \u593e<div style=\"width:100%;height:3px;\"></div>\u56db \u5341 \u4e94 \u5ea6\uff0c\u5728 \u6b64 \u8a2d \u5b9a \u4e0b SLM \u70ba \u632f \u5e45 \u8abf \u5236 \u5668\uff0c\u6574 \u7d44 \u5149 \u5b78 \u7cfb \u7d71 \u5c31 \u662f \u7c21<div style=\"width:100%;height:3px;\"></div>\u55ae \u7684 \u6295 \u5f71 \u7cfb \u7d71\uff0c\u4e5f \u5229 \u7528 \u6b64 \u7cfb \u7d71 \u4e86 \u89e3 \u6210 \u50cf \u7cfb \u7d71 \u4e2d \u7684 \u5404 \u9805 \u53c3 \u6578 \u5982: <div style=\"width:100%;height:3px;\"></div>f-number, Aperture Stop, Entrance Pupil, Exit pupil..\u7b49\u3002 <br /><div style=\"width:100%;height:80px;\"></div></div></html>
desPhaseModulation = <html><div style="padding-left:6px;padding-top:5px;margin: 0 0.07em 0 -0.13em;background-color:white;width:100%;word-spacing:30px;font-family:MS Mincho;font-size:11px;font-weight: normal;">&nbsp; &nbsp; &nbsp; \u5728 \u5be6 \u9a57 \u4e8c \u88e1\uff0c\u6211 \u5011 \u4f7f \u504f \u632f \u7247 \u53ca \u6aa2 \u504f \u7247 \u7684 \u89d2 \u5ea6 \u8207 \u914d \u5411 \u89d2 \u593e \u56db<div style=\"width:100%;height:3px;\"></div>\u5341 \u4e94 \u5ea6 \u505a \u70ba \u632f \u5e45 \u8abf \u5236 \u5668\u3002\u5728 \u76f8 \u4f4d \u8abf \u5236 \u4e0a\uff0c\u6211 \u5011 \u9019 \u6b21 \u6539 \u8b8a \u504f \u632f \u7247 \u53ca<div style=\"width:100%;height:3px;\"></div>\u6aa2 \u504f \u7247 \u7684 \u89d2 \u5ea6 \u4f7f \u5176 \u8207 \u914d \u5411 \u89d2 \u5e73 \u884c \u505a \u70ba \u76f8 \u4f4d \u8abf \u5236 \u5668\uff0c\u63a5 \u8457 \u6211 \u5011 \u5229<div style=\"width:100%;height:3px;\"></div>\u7528 \u50be \u659c \u5f0f \u5149 \u67f5(Blazed Grating)\u8b93 \u76f8 \u4f4d \u8abf \u5236 \u5668 \u505a \u7c21 \u55ae \u7684 \u5149 \u675f \u63a7 \u5236<div style=\"width:100%;height:3px;\"></div>(Beam Steering) \u5be6 \u9a57 \u4f86 \u4e86 \u89e3 \u7e5e \u5c04 \u89d2 \u5ea6 \u7684 \u6975 \u9650\u3002 <div style=\"width:100%;height:100px;\"></div></html>
desMichelson = <html><div style="padding-left:5px;padding-top:5px;margin: 0 0.07em 0 -0.13em;background-color:white;width:100%;word-spacing:30px;font-family:MS Mincho;font-size:11px;font-weight: normal;">&nbsp; &nbsp; &nbsp; \u5e72 \u6d89 \u7684 \u73fe \u8c61 \u662f \u7531 \uf978 \u500b \u6216 \uf978 \u500b \u4ee5 \u4e0a \u7684 \u5149 \u6ce2 \u758a \u52a0 \u65bc \u7a7a \u9593 \u4e4b \u4e2d<br /><div style=\"width:100%;height:3px;\"></div> \u800c \u7522 \u751f\u3002\u7531 \u5149 \u7a0b \u5dee \u6240\n\u9020 \u6210 \u7684 \u76f8 \u4f4d \u5dee \u800c \u7522 \u751f \uf977 \u7d0b\uff08\u5efa \u8a2d \u6027 \u5e72 \u6d89\uff09\u8207<br /><div style=\"width:100%;height:3px;\"></div> \u6697 \u7d0b\uff08\u7834 \u58de \u6027 \u5e72 \u6d89\uff09\u7b49 \u5e72 \u6d89 \u689d \u7d0b\u3002\u8981\n\u89c0 \u5bdf \u5230 \u5e72 \u6d89 \u689d \u7d0b \u9664 \u4e86 \u9700 \u8981 \u4e0a <br /><div style=\"width:100%;height:3px;\"></div> \u8ff0 \u7684 \u76f8 \u4f4d \u5dee \u6240 \u9020 \u6210 \u7684 \u5efa \u8a2d \u6027 \u5e72 \u6d89 \u8207 \u7834 \u58de \u6027 \u5e72 \u6d89 \u4e4b \u5916,\n\u9084 \u9700 \u8981<br /><div style=\"width:100%;height:3px;\"></div>\u6ce8 \u610f \u5149 \u6ce2 \u504f \u632f \u65b9 \u5411 \u8207 \u76f8 \u5e72 \u6027\uff08coherence\uff0c\u7c21 \u800c \u8a00 \u4e4b\uff0c\uf978 \u500b \u6709 \u76f8 \u540c <br /><div style=\"width:100%;height:3px;\"></div>\n\u504f \u632f \u7684 \u5149 \u6ce2 \u5230 \u9054 \u5c4f \u5e55 \u7684 \u5149 \u7a0b \u5dee\u8d8a \u63a5 \u8fd1 \u7684 \u8a71\uff0c\u5e72 \u6d89 \u689d \u7d0b \u7684 \u5c0d \u6bd4 \u4e5f<br /><div style=\"width:100%;height:3px;\"></div> \u6703 \u8d8a \u597d\u3002<br /><div style=\"width:100%;height:3px;\"></div>&nbsp; &nbsp; &nbsp; \u672c \u5be6 \u9a57 \u4e2d \u7684 \u5e72 \u6d89 \u5100 \u5229 \u7528 \u4e86 \u5206 \u5149 \u93e1 \u5c07 \u5165 \u5c04 \u7684 \u96f7 \u5c04 \u5149 \u5206 \u6210 \uf978<br /><div style=\"width:100%;height:3px;\"></div>\u9053 \u5149 \uff0c\u4e00 \u9053 \u7a7f \u900f \u5149 \u8207 \u4e00 \u9053 \u53cd \u5c04 \u5149\uff0c\u9019 \u7a2e \u5206 \u5149 \u7684 \u539f \u7406 \u88ab \u5206 \u985e \u70ba \u632f<br /><div style=\"width:100%;height:3px;\"></div>\u5e45 \u5206 \u5149 (division of amplitude) \u548c \u694a \u683c \u96d9 \u72f9 \u7e2b \u5e72 \u6d89 \u4e2d \u5229 \u7528 \u76f8 \u9130 \u7684 \uf978<br /><div style=\"width:100%;height:3px;\"></div>\u689d \u72f9 \u7e2b \u628a \u540c \u4e00 \u9053 \u6ce2 \u524d \u5206 \u6210 \uf978 \u9053 \u65b0 \u7684 \u5149 \u6e90 \u7684 \u6ce2 \u524d \u5206 \u5149(division of<br /><div style=\"width:100%;height:3px;\"></div>wave front) \u4e0d \u540c \u3002 \u63a5 \u8457 \u7531 \u5206 \u5149 \u6240 \u5206 \u51fa \u7684 \u7a7f \u900f \u5149 \u7d93 \u7531 \u76f8 \u4f4d \u8abf \u5236 \u5668<br /><div style=\"width:100%;height:3px;\"></div>\u7522 \u751f \u5404 \u7a2e \u6ce2 \u524d \u8207 \u53cd \u5c04 \u5149 \u7d93 \u7531 \u9762 \u93e1 \u53cd \u5c04 \u56de \u4f86 \u5728 \u7a7a \u9593 \u4e2d \u4ea4 \u6703 \u7522 \u751f<br /><div style=\"width:100%;height:3px;\"></div>\u5e72 \u6d89\uff0c \u4e26 \u80fd \u5728 \u5c4f \u5e55 \u4e0a \u89c0 \u5bdf \u5230 \u5e72 \u6d89 \u5716 \u5f62\u3002<br /><div style=\"width:100%;height:3px;\"></div></div></html>
desDiffaction = <html><div style="padding-left:5px;padding-top:5px;margin: 0 0.07em 0 -0.13em;background-color:white;width:100%;word-spacing:30px;font-family:MS Mincho;font-size:11px;font-weight: normal;">&nbsp; &nbsp; &nbsp; \u5149 \u7684 \u6ce2 \u52d5 \u6027 \u8cea \u53ef \u4ee5 \u5f88 \u5bb9 \u6613 \u5730 \u5f9e \u5e72 \u6d89 \u8207 \u7e5e \u5c04 \u7684 \u73fe \u8c61 \u4e2d \u89c0 \u5bdf<br /><div style=\"width:100%;height:3px;\"></div>\u5230\uff0c\u8981 \u89e3 \u91cb \u5176 \u539f \u56e0 \u5f97 \u5148 \u5f9e <strong>Huygens-Fresnel</strong> \u539f \u7406 \u8aaa \u8d77\uff0c\u5176 \u5167 \u5bb9 \u70ba \u6ce2<br /><div style=\"width:100%;height:3px;\"></div>\u524d \u4e0a \u6bcf \u4e00 \u9ede \u90fd\u53ef \u8996 \u70ba \u65b0 \u7684 \u9ede \u6ce2 \u6e90 \u5404 \u81ea \u767c \u51fa \u6b21 \u7d1a \u7403 \u9762 \u6ce2\uff0c\u6ce2 \u524d \u7684<br /><div style=\"width:100%;height:3px;\"></div>\u65b0 \u4f4d \u7f6e \u5247 \u662f \u9019 \u4e9b \u7403 \u9762 \u7684 \u5305 \u7d61 \u9762\u3002\u56e0 \u6b64 \u5728 \u55ae \u72f9 \u7e2b \u7e5e \u5c04 \u5be6 \u9a57 \u4e2d\uff0c\u5e73<br /><div style=\"width:100%;height:3px;\"></div>\u9762 \u6ce2 \u9047 \u4e0a \u72f9 \u7e2b \u5f8c\uff0c\u72f9 \u7e2b \u4e0a \u7684 \u6bcf \u4e00 \u9ede \u90fd \u8996 \u70ba \u65b0 \u7684 \u9ede \u5149 \u6e90 \u5728 \u5404 \u65b9<br /><div style=\"width:100%;height:3px;\"></div>\u5411 \u767c \u51fa \u5149 \u6ce2\uff0c\u76f4 \u9032 \u7684 \u975e \u7e5e \u5c04 \u5149 \u5728 \u9060 \u8655 \u4ee5 \u76f8 \u540c \u7684 \u76f8 \u4f4d \u5230 \u9054 \u5c4f \u5e55<br /><div style=\"width:100%;height:3px;\"></div>\u5f62 \u6210 \uf977 \u9ede\u3002\u73fe \u5728 \u6709 \u53e6 \u4e00 \u675f \u5149 \u4ee5 \u8207 \u6c34 \u5e73 \u593e \u89d2 \u03b8 \u7684 \u65b9 \u5411 \u884c \u9032\uff0c\u7576 \u5149<br /><div style=\"width:100%;height:3px;\"></div>\u675f \u6700 \u4e0a \u5c64 \u8207 \u6700 \u4e0b \u5c64 \u7684 \u5149 \u7a0b \u5dee \u525b \u597d \u70ba \u4e00 \u500b\u6ce2\u9577\u6642\uff0c \u6b63\u4e2d \u9593 \u7684 \u5149 \u675f<br /><div style=\"width:100%;height:3px;\"></div>\u6703 \u8207 \u6700 \u4e0a \u9762 \u7684 \u5149 \u675f \u76f8 \u5dee \u4e86 \u534a \u500b \u6ce2 \u9577 (\u76f8 \u4f4d \u76f8 \u5dee \u00f6)\u800c \u76f8 \u6d88\uff0c\u63a5 \u8457<br /><div style=\"width:100%;height:3px;\"></div>\u5f80 \u4e0b \u63a8 \u4e0b \u53bb \u6574 \u675f \u5149 \u90fd \u6703 \u76f8 \u5dee \u534a \u6ce2 \u9577 \u800c \u76f8 \u6d88 \u6389\uff0c\u6700 \u5f8c \u5728 \u5c4f \u5e55 \u4e0a<br /><div style=\"width:100%;height:3px;\"></div>\u986f \u793a \u6697 \u7d0b\u3002\u4f9d \u76f8 \u540c \u7684 \u539f \u7406 \u53ef \u63a8 \u5f97 \u7576 \u5149 \u7a0b \u5dee \u70ba \u6ce2 \u9577 \u6574 \u6578 \u500d \u6642 \u5373<br /><div style=\"width:100%;height:3px;\"></div>\u6703 \u7522  \u751f \u6697 \u7d0b\u3002 \u694a \u683c \u7684 \u96d9 \u72f9 \u7e2b \u5be6 \u9a57 \u70ba \u6ce2 \u524d \u5206 \u5149 \u7684 \u5e72 \u6d89 \u5100,\u539f \u6ce2<br /><div style=\"width:100%;height:3px;\"></div>\u524d \u88ab \uf978 \u689d \u72f9 \u7e2b \u64cb \u4f4f \u53ea \u7559 \u4e0b \u901a \u904e \u72f9 \u7e2b \u7684 \u90e8 \u4efd\uff0c\u901a \u904e \u72f9 \u7e2b \u7684 \u5149 \u88ab<br /><div style=\"width:100%;height:3px;\"></div>\u8996 \u70ba \u65b0 \u7684 \u9ede \u6ce2 \u6e90 \u5728 \u9060 \u8655 \u5c4f \u5e55 \u4e0a \u5f62 \u6210 \u5e72 \u6d89 \u689d \u7d0b\uff0c \uf978 \u500b \u9ede \u6ce2\u6e90 \u6703<br /><div style=\"width:100%;height:3px;\"></div>\u5f80 \u56db \u9762 \u516b \u65b9 \u6563 \u51fa \u5149 \u7dda\uff0c\u7576 \u5c04 \u51fa \u5149 \u7dda \u8207 \u6c34 \u5e73 \u593e \u89d2 \u70ba \uf066\uff0c\u5149 \u7a0b \u5dee \u70ba<br /><div style=\"width:100%;height:3px;\"></div>\u4e00 \u500b \u6ce2 \u9577 \u6642\uff0c\uf978 \u675f \u70ba \u5efa \u8a2d \u6027 \u5e72 \u6d89\uff0c\u6700 \u5f8c \u5728 \u9060 \u8655 \u5c4f \u5e55 \u5f62 \u6210 \uf977 \u7d0b \u3002<br /><div style=\"width:100%;height:3px;\"></div>\u6b64 \u7d50 \u679c \u8207 \u55ae \u72f9 \u7e2b \u4e0d \u540c\uff0c\u540c \u6a23 \u5728 \u6700 \u4e0a \u65b9 \u8207 \u6700 \u4e0b \u65b9 \u7684 \u5149 \u6e90 \u8655 \u76f8 \u5dee<br /><div style=\"width:100%;height:3px;\"></div>\u6574 \u6578 \u500d \u6ce2 \u9577\uff0c\u4f46 \u7522 \u751f \u7684 \u7d50 \u679c \u70ba \u4e00 \u500b \u6697 \u7d0b \u4e00 \u500b \uf977 \u7d0b\uff0c\u81f3 \u65bc \u96d9 \u72f9 \u7e2b<br /><div style=\"width:100%;height:3px;\"></div>\u7684 \u6697 \u7d0b \u5247 \u6703 \u5728 \u5149 \u7a0b \u5dee \u7b49 \u65bc \u534a \u6ce2 \u9577 \u9020 \u6210 \u7834 \u58de \u6027 \u5e72 \u6d89 \u6642 \u7522 \u751f\u3002<br /><br /></div></html>
desSpectrometer = <html><div style="padding-left:5px;padding-top:5px;margin: 0 0.07em 0 -0.13em;background-color:white;width:100%;word-spacing:30px;font-family:MS Mincho;font-size:11px;font-weight: normal;">&nbsp; &nbsp; &nbsp; \u5149 \u8b5c \u5100 \u5e38 \u88ab \u61c9 \u7528 \u65bc \u5404 \u7a2e \u6750 \u6599 \u7684 \u5149 \u7279 \u6027 \u5206 \u6790 \u4e0a\uff0c \u9019 \u662f \u7531 \u65bc<br /><div style=\"width:100%;height:3px;\"></div>\u5149 \u8b5c \u5100 \u53ef \u4ee5 \u5206 \u6790 \u5149 \u8b5c \u4e26 \u91cf \u6e2c \u5404 \u6ce2 \u9577 \u7684 \u5f37 \u5ea6 \u5206 \u5e03\u3002 \u5176 \u539f \u7406 \u70ba \u5229<br /><div style=\"width:100%;height:3px;\"></div>\u7528 \u4e0d \u540c \u983b \u7387 \u7684 \u5149 \u5c0d \u540c \u4e00 \u5468 \u671f \u6027 \u5149 \u67f5 \u6703 \u6709 \u4e0d \u540c \u7684 \u7e5e \u5c04 \u89d2 \u5ea6\uff0c \u5047<br /><div style=\"width:100%;height:3px;\"></div>\u8a2d \u5149 \u67f5 \u5468 \u671f \u70ba d\u3001 \u6ce2 \u9577 \u70ba \u03bb\u3001 \u7e5e \u5c04 \u89d2 \u5ea6 \u70ba \u03b8\uff0c\u7576 \u5468 \u671f \u6027 \u7684 \u5149 \u67f5<br /><div style=\"width:100%;height:3px;\"></div>\u8207 \u6ce2 \u9577 \u95dc \u4fc2 \u5982 \u4e0b \u6642<br /><div style=\"width:100%;height:6px;\"></div><div style=\"font-size:16px;font-weight:bold;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp; &nbsp; &nbsp; dsin\u03b8m = m\u03bb </div> <br /><div style=\"width:100%;height:3px;\"></div>\u5176 \u4e2d m \u70ba \u7e5e \u5c04 \u968e \u6578\uff0c \u6b64 \u6642 \u8207 \u539f \u5149 \u8def \u593e \u03b8m \u7684 \u65b9 \u5411 \u4fbf \u6709 \u7e5e \u5c04 \u5149 \u7522<br /><div style=\"width:100%;height:3px;\"></div>\u751f\u3002\u96a8 \u8457 \u6ce2 \u9577 \u7684 \u4e0d \u540c \u6240 \u9020 \u6210 \u7684 \u7e5e \u5c04 \u89d2 \u5ea6 \u4e5f \u4e0d \u540c \uff0c \u7d50 \u679c \u5982 \u4e0b \u5716\uff0c<br /><div style=\"width:100%;height:3px;\"></div>\u6aa2 \u6e2c \u5149 \u5165 \u5c04 \u81f3 \u5149 \u67f5 \u88e1 \u53d7 \u5468 \u671f \u6027 \u5149 \u67f5 \u7684 \u5f71 \u97ff \u4e0d \u540c \u6ce2 \u9577 \u7684 \u5149 \u7e5e \u5c04<br /><div style=\"width:100%;height:3px;\"></div>\u81f3 \u4e0d \u540c \u65b9 \u5411\uff0c\u7d05 \u8272 \u7531 \u65bc \u6ce2 \u9577 \u8f03 \u9577 \u6240 \u4ee5 \u89d2 \u5ea6 \u4e5f \u6703 \u8ddf \u8457 \u8b8a \u5927\uff0c \u85cd \u8272<br /><div style=\"width:100%;height:3px;\"></div>\u7531 \u65bc \u6ce2 \u9577 \u8f03 \u77ed \u6240 \u4ee5 \u89d2 \u5ea6 \u6703 \u6bd4 \u8f03 \u63a5 \u8fd1 \u539f \u53cd \u5c04 \u8def \u7dda\uff0c \u63a5 \u8457 \u7531 \u900f \u93e1<br /><div style=\"width:100%;height:3px;\"></div>\u5c07 \u4e0d \u540c \u6ce2 \u9577 \u7684 \u5149 \u805a \u7126 \u5728 \u7126 \u5e73 \u9762 \u4e0a\uff0c \u4e26 \u91cf \u6e2c \u5404 \u6ce2 \u6bb5 \u4f4d \u7f6e\u3001\u89d2 \u5ea6 \u4f86<br /><div style=\"width:100%;height:3px;\"></div> \u63a8 \u7b97 \u5176 \u6ce2 \u9577\u3002</div></html>
desSignalProcessing = <html><div style="padding-left:6px;padding-top:5px;margin: 0 0.07em 0 -0.13em;background-color:white;width:100%;word-spacing:30px;font-family:MS Mincho;font-size:11px;font-weight: normal;">&nbsp; &nbsp; &nbsp; \u7cfb \u7d71 \u70ba \u5149 \u5b78 \u4e0a \u5e38 \u898b \u7684 \u8a0a \u865f \u8655 \u7406 \u7cfb \u7d71\uff0c\u7cfb \u7d71 \u70ba \u5c31 \u662f \u5c07 \u8f38 \u5165 \u7684<br /><div style=\"width:100%;height:3px;\"></div>\u8cc7 \u6599 \u653e \u7f6e \u65bc \u7b2c \u4e00 \u9762 \u900f \u93e1 \u7684 \u524d \u7126 \u5e73 \u9762 \u4e0a\uff0c\u4e26 \u5728 \u5f8c \u7126 \u5e73 \u9762 \u7522 \u751f \u5176 \u983b<br /><div style=\"width:100%;height:3px;\"></div>\u8b5c\uff0c\u63a5 \u8457 \u7d93 \u904e \u6ffe \u6ce2 \u5f8c\uff0c\u518d \u7531 \u7b2c \u4e8c \u9762 \u900f \u93e1 \u518d \u505a \u4e00 \u6b21 \u5085 \u6c0f \u8f49 \u63db \u6700 \u5f8c \u7522<br /><div style=\"width:100%;height:3px;\"></div>\u751f \u6ffe \u6ce2 \u5f8c \u7684 \u5716 \u5f62 \u3002 \u9032 \u884c \u6ffe \u6ce2 \u6642 \u5c31 \u5728 \u6b64 \u983b \u8b5c \u9762 \u906e \u64cb \u4e0d \u8981 \u7684 \u983b \u7387\uff0c<br /><div style=\"width:100%;height:3px;\"></div>\u906e \u64cb \u9ad8 \u983b\u3001\u4f4e \u983b\u3001x \u65b9 \u5411 \u7684 \u983b \u7387\u3001y \u65b9 \u5411 \u7684 \u983b \u7387 \u7686 \u6703 \u5728 \u6700 \u5f8c \u7684 \u6210 \u50cf<br /><div style=\"width:100%;height:3px;\"></div>\u9762 \u4e0a \u6709 \u4e0d \u540c \u7684 \u8b8a \u5316\u3002<br /><div style=\"width:100%;height:80px;\"></div></div></html>
desPhaseRetarder = <html><div style="padding-left:6px;padding-right:5px;padding-top:5px;margin: 0 0.07em 0 -0.13em;background-color:white;width:100%;word-spacing:30px;font-family:MS Mincho;font-size:11px;font-weight: normal;">&nbsp; &nbsp; &nbsp; \u76f8 \u79fb \u5f0f \u6578 \u4f4d \u5168 \u50cf \u8853 \u4ee5 \u5149 \u7684 \u5e72 \u6d89 \u539f \u7406 \u70ba \u57fa \u790e\uff0c\u6539 \u8b8a \u7269 \u5149 \u53ca \u53c3<br /><div style=\"width:100%;height:3px;\"></div> \u8003 \u5149 \u7684 \u76f8 \u5c0d \u76f8 \u4f4d\uff0c\u901a \u5e38 \u662f \u5229 \u7528 \u58d3 \u96fb \u6750 \u6599 \u6539 \u8b8a \u53c3 \u8003 \u5149 \u7684 \u5149 \u7a0b \u4f86 \u9020<br /><div style=\"width:100%;height:3px;\"></div>\u6210 \u76f8 \u4f4d \u5dee \u4f7f \u5e72 \u6d89 \u689d \u7d0b \u5206 \u5e03 \u6539 \u8b8a\uff0c\u91cd \u8907 \u6578 \u6b21 \u5f8c \u5f97 \u5230 \u591a \u5f35 \u4e0d \u540c \u5e72 \u6d89<br /><div style=\"width:100%;height:3px;\"></div>\u689d \u7d0b\uff0c\u518d \u7d93 \u7531 \u9019 \u4e9b \u5e72 \u6d89 \u5716 \u5f62 \u7684 \u5149 \u5f37 \u5206 \u5e03 \u8b8a \u5316 \u6c42\u5f97 \u539f \u7269 \u6ce2 \u7684 \u76f8 \u4f4d<br /><div style=\"width:100%;height:3px;\"></div>\u5206 \u5e03\u3002\u5f97 \u5230 \u4e86 \u7269 \u6ce2 \u7684 \u5149 \u5f37 \u53ca \u76f8 \u4f4d\uff0c\u6211 \u5011 \u5373 \u80fd \u5229 \u7528 \u8fd1 \u5834 \u7e5e \u5c04 \u7406 \u8ad6 <br /><div style=\"width:100%;height:3px;\"></div>\u56de \u63a8 \u51fa \u539f \u9ad4\u3002<br /><div style=\"width:100%;height:80px;\"></div></div></html>
desTalbot = <html><div style="padding-left:6px;padding-right:5px;padding-top:5px;margin: 0 0.07em 0 -0.13em;background-color:white;width:100%;word-spacing:30px;font-family:MS Mincho;font-size:11px;font-weight: normal;">&nbsp; &nbsp; &nbsp; \u7e5e \u5c04 \u7406 \u8ad6 \u4e2d \u7684 \u8fd1 \u5834 \u7e5e \u5c04 \u7406 \u8ad6 (Fresnel Diffraction) \u6709 \u8457 \u76f8 \u7576 \u8907<br /><div style=\"width:100%;height:3px;\"></div>\u96dc \u7684 \u7a4d \u5206 \u516c \u5f0f, \u4e00 \u822c \u7a4d \u5206 \u7684 \u7d50 \u679c \u53ef \u7531 \u65b9 \u5b54 \u7e5e \u5c04 \u770b \u51fa \u662f \u76f8 \u7576 \u9f90 \u5927<br /><div style=\"width:100%;height:3px;\"></div>\u4e14 \u8907 \u96dc\uff0c\u4f46 \u9031 \u671f \u6027 \u5149 \u67f5 \u7684 \u7e5e \u5c04 \u537b \u6709 \u8f03 \u7c21 \u55ae \u7684 \u7d50 \u679c \u53ca \u7279 \u6b8a \u7684 \u81ea \u6210<br /><div style=\"width:100%;height:3px;\"></div>\u50cf \u73fe \u8c61 \u767c \u751f. Talbot Images \u70ba \u9031 \u671f \u6027 \u5149 \u67f5 \u5728 \u8fd1 \u5834 \u7e5e \u5c04 \u6642 \u6240 \u7522 \u751f \u7684<br /><div style=\"width:100%;height:3px;\"></div>\u81ea \u6210 \u50cf\uff0c\u5176 \u7522 \u751f \u7684 \u4f4d \u7f6e \u8207 \u5149 \u67f5 \u9031 \u671f \u5e73 \u65b9 \u6210 \u6b63 \u6bd4\uff0c\u6ce2 \u9577 \u6210 \u53cd \u6bd4\uff0c \u4e26<br /><div style=\"width:100%;height:3px;\"></div>\u5728 \u5176 \u6574 \u6578 \u500d \u7684 \u8ddd \u96e2 \u4e0a \u6703 \u4e00 \u76f4 \u770b \u5230 \u81ea \u6210 \u50cf\uff0c\u800c \u5728 \u9019 \u4e9b \u6210 \u50cf \u7684 \u4e2d \u9593<br /><div style=\"width:100%;height:3px;\"></div>\u9084 \u80fd \u89c0 \u5bdf \u5230 \u8207 \u539f \u5f71 \u50cf \u5c0d \u6bd4 \u76f8 \u53cd \u7684 \u81ea \u6210 \u50cf\uff0c\u5be6 \u9a57 \u4e2d \u7531 &nbsp;SLM&nbsp; \u7522 \u751f \u9031 <br /><div style=\"width:100%;height:3px;\"></div>\u671f \u6027 \u5149 \u67f5\uff0c\u4e26 \u7531 CCD \u62cd \u651d \u6240 \u7522 \u751f \u7684 \u81ea \u6210 \u50cf\uff0c\u6539 \u8b8a CCD \u7684 \u4f4d \u7f6e \u89c0 \u5bdf \u5f71<br /><div style=\"width:100%;height:3px;\"></div>\u50cf \u8b8a \u5316 \u53ca \u4f4d \u7f6e\u3002<br /><div style=\"width:100%;height:15px;\"></div></div></html>
desWavefront = <html><div style="padding-left:6px;padding-right:5px;padding-top:5px;margin: 0 0.07em 0 -0.13em;background-color:white;width:100%;word-spacing:30px;font-family:MS Mincho;font-size:11px;font-weight: normal;">&nbsp; &nbsp; SLM (Spatial Light Modulator) \u80fd \u63a5 \u53d7 \u96fb \u5b50 \u8a0a \u865f \u4f86 \u6539 \u8b8a \u5149 \u8a0a \u865f \u96fb \u5b50<br /><div style=\"width:100%;height:3px;\"></div>\u8a0a \u865f \u4f7f \u6db2 \u6676 \u5206 \u5b50 \u6392 \u5217 \u65b9 \u5411 \u504f \u8f49 \u6539 \u8b8a \u6db2 \u6676 \u7684 \u6298 \u5c04 \u7387\uff0c \u4f7f \u5f97 \u901a \u904e<br /><div style=\"width:100%;height:3px;\"></div>SLM \u7684 \u5149 \u80fd \u6709 \u4e0d \u540c \u7684 \u76f8 \u4f4d \u5ef6 \u9072 \u4f86 \u9020 \u6210 \u504f \u632f \u614b \u7684 \u6539 \u8b8a\uff0c\u518d \u914d \u5408 \u4e0a<br /><div style=\"width:100%;height:3px;\"></div>\u504f \u632f \u7247 \u53ca \u6aa2 \u504f \u7247 \u7684 \u4f7f \u7528 \u4f86 \u6539 \u8b8a \u5149 \u6ce2 \u7684 \u632f \u5e45 \u6216 \u76f8 \u4f4d\u3002\u8abf \u5236 \u51fa \u5408 \u9069<br /><div style=\"width:100%;height:3px;\"></div>\u7684 \u5149 \u8a0a \u865f \u9664\u4e86\u80fd \u9020 \u6210 \u5404 \u7a2e \u4e0d \u540c \u7269 \u6ce2 \u4f86 \u7522 \u751f \u5f71 \u50cf \u5916\uff0c\u9084 \u80fd \u8b93 SLM \u64ec<br /><div style=\"width:100%;height:3px;\"></div>\u51fa \u5404 \u7a2e \u7c21 \u55ae \u7684 \u6ce2 \u5f62\uff0c\u5982 \u7403 \u9762 \u6ce2\u3001\u5713 \u67f1 \u6ce2\u3001\u53ca \u5404 \u7a2e \u4e0d \u540c \u65b9 \u5411 \u50b3 \u6a21 \u905e<br /><div style=\"width:100%;height:3px;\"></div>\u7684 \u5e73 \u9762 \u6ce2\uff0c\u800c \u9019 \u4e9b \u6ce2 \u5f62\u4e00\u822c \u90fd \u662f \u7531 \u900f \u93e1\u3001\u5713 \u67f1 \u900f \u93e1\u3001\u5e73 \u9762 \u93e1 \u4f86 \u7522 \u751f<br /><div style=\"width:100%;height:3px;\"></div>\u6240 \u4ee5 \u80fd \u88fd \u9020 \u51fa \u9019 \u4e9b \u6ce2 \u5f62 \u4e5f \u4ee3 \u8868 \u8457 SLM \u80fd \u7576 \u4f5c \u53ef \u8abf \u8b8a \u7684 \u5149 \u5b78 \u5143 \u4ef6<br /><div style=\"width:100%;height:3px;\"></div><br /><div style=\"width:100%;height:15px;\"></div></div></html>
desBeamShifting = <html><b>No description available</b><br></html>
desImportFormula = <html><b>No description available</b><br></html>